#+STARTUP: overview

*** Tests

Hello world.
*résultat attendu* : Hello, world!
#+BEGIN_SRC rust :results raw replace
  fn main() {
      println!("Hello, world!");
  }
#+END_SRC

#+RESULTS:
Hello, world!

*** Tests

Je ne suis pas sûr de comment vraiment tester les arguments passés à la compilation, je n'ai pas
l'impression qu'ils soient vraiment utiles avec org babel, pour le moment en tout cas.

Ne s'exécute pas parce que le fichier ~prout~ est introuvable.
*résultat attendu* : error
#+BEGIN_SRC rust :cmpflag -o prout
  fn main() {
      println!("Hello, world!");
  }
#+END_SRC

Doit afficher les arguments passés à l'exécutable
*résultat attendu* : ["filename" (\, "1") (\, "2") (\, "bonjour")]
#+BEGIN_SRC rust :cmdline 1 2 bonjour :results raw
  use std::env;

  fn main() {
      let args: Vec<String> = env::args().collect();
      println!("{:?}", args);
  }
#+END_SRC

#+RESULTS:
["/tmp/babel-1181JKm/rust-src-1181-7L" (\, "1") (\, "2") (\, "bonjour")]

*** Tests
    :PROPERTIES:
    :CUSTOM_ID: 0.2.1-tests
    :END:

S'exécute normalement, un fichier ~prout~ exécutable est bien généré.
*résultat attendu* : Hello, world!
#+BEGIN_SRC rust :cmpflag -o prout :results verbatim
  fn main() {
      println!("Hello, world!");
  }
#+END_SRC

#+RESULTS:
: Hello, world!

S'exécute normalement, un fichier exécutable est généré dans $HOME.
*résultat attendu* : Hello, world!
#+BEGIN_SRC rust :cmpflag --out-dir /home/eldruz :results verbatim
  fn main() {
      println!("Hello, world!");
  }
#+END_SRC

#+RESULTS:
: Hello, world!

S'exécute normalement, l'argument =--out-dir= a été ignoré.
*résultat attendu* : Hello, world!
#+BEGIN_SRC rust :cmpflag -o pataprout --out-dir /home/eldruz :results verbatim
  fn main() {
      println!("Hello, world!");
  }
#+END_SRC

#+RESULTS:
: Hello, world!

S'exécute normalement, le fichier généré est =/home/eldruz/pataprout=.
*résultat attendu* : Hello, world!
#+BEGIN_SRC rust :cmpflag -o /home/eldruz/pataprout :results verbatim
  fn main() {
      println!("Hello, world!");
  }
#+END_SRC

#+RESULTS:
: Hello, world!

** 0.3

Quelques tests pour voir ce qui est autorisé en rust ou pas.

Est-ce qu'on a besoin de séparer les =use:xxx;= du bloc main ou pas ?
#+BEGIN_SRC rust :cmdline 1 2 bonjour :results raw
  fn main() {
      use std::env;

      let args: Vec<String> = env::args().collect();
      println!("{:?}", args);
  }
#+END_SRC

#+RESULTS:
["/tmp/babel-7991_kk/rust-src-7991Tay" (\, "1") (\, "2") (\, "bonjour")]

Visiblement non.

Et est-ce qu'il faut séparer les déclarations de fonctions du code main ou pas ?
#+BEGIN_SRC rust :results verbatim
  fn main() {
      fn add(a: usize, b: usize) -> usize {
          a + b
      }

      println!("{:?}", add(3,4));
  }
#+END_SRC

#+RESULTS:
: 7

Non plus.

Donc notre wrapper peut se contenter d'être extrêmement simple, en encapsulant tout le code dans une
fonction =main=. Pour faire cela je vais m'inspirer du code de =ob-lua= et préparer une string dans
laquelle insérer le code dource via un format. Il faudra aussi que je détecte si une fonction main est
fournie ou pas dans le code source avant de faire l'éventuel traitement.


#+name: ob-rust-0.3
#+BEGIN_SRC elisp
  (require 'ob)

  (defvar org-babel-tangle-lang-exts)
  (add-to-list 'org-babel-tangle-lang-exts '("rust" . "rs"))

  (defcustom org-babel-rust-command "rustc"
    "Name of the rust command."
    :group 'org-babel
    :type 'string)

  (defun org-babel-execute:rust (body params)
    (let* ((full-body (org-babel-expand-body:rust body params))
           (cmpflag (or (cdr (assq :cmpflag params)) ""))
           (cmdline (or (cdr (assq :cmdline params)) ""))
           (default-directory org-babel-temporary-directory)
           (src-file (org-babel-temp-file "rust-src-" ".rs"))
           (exe-file (org-babel-rust-exe-file src-file cmpflag))
           (results))
      (debug)
      (with-temp-file src-file (insert full-body))
      (org-babel-eval
       (format "%s %s %s" org-babel-rust-command cmpflag src-file) "")
      (setq results (org-babel-eval (format "%s %s" exe-file cmdline) ""))
      (org-babel-reassemble-table
       (org-babel-result-cond (cdr (assq :result-params params))
         (org-babel-read results)
         (let ((tmp-file (org-babel-temp-file "rs-")))
           (with-temp-file tmp-file (insert results))
           (org-babel-import-elisp-from-file tmp-file)))
       (org-babel-pick-name
        (cdr (assq :colname-names params)) (cdr (assq :colnames params)))
       (org-babel-pick-name
        (cdr (assq :rowname-names params)) (cdr (assq :rownames params))))))

  ;;; Helper functions.

  (defun org-babel-rust-exe-file (src-file cmpflag)
    "Compute the executable name according to the parameters given
     to the command line. It assumes that the source file has been
     created at (org-babel-temporary-directory). For spaces to be
     correctly recognized they need to be escaped."
    (if (string= cmpflag "")
        (file-name-sans-extension src-file)
      (let* ((flag-list (split-string cmpflag " "))
             (out-file (nth 1 (member "-o" flag-list)))
             (out-dir (nth 1 (member "--out-dir" flag-list))))
        (cond
         (out-file
          (if (string-match-p "^/" out-file) ;naive absolute file path detection
              (expand-file-name out-file "/")
            (expand-file-name out-file org-babel-temporary-directory)))
         (out-dir
          (expand-file-name (file-name-base src-file) (file-name-as-directory out-dir)))
         (t
          (file-name-sans-extension src-file))))))

  (defun org-babel-rust-ensure-main-wrap (body)
    "Wrap BODY in a \"main\" function call if none exists."
    (if (string-match org-babel-rust-main-regexp body)
        body
      (format org-babel-rust-main-wrapper body)))

  (defun org-babel-expand-body:rust (body params)
    "Expand a block of rust code with org-babel according to its
  header arguments."
    (let* ((main-p (not (string= (cdr (assq :main params)) "no")))
           (uses (org-babel-read (cdr (assq :use params)) nil)))
      (when (stringp uses)
        (setq uses (split-string uses)))
      (mapconcat
       'identity
       (list
        ;;uses
        (mapconcat
         (lambda (use) (format "use %s;" use))
         uses
         "\n")
        (when main-p
          (org-babel-rust-ensure-main-wrap body)))
       "\n")))

  (defvar org-babel-rust-main-regexp
    "^[ \t]*[fun]+[ \t\n\r]*main[ \t]*(.*)")

  (defvar org-babel-rust-main-wrapper
    "
  fn main() {
    %s
  }
  ")
#+END_SRC

#+RESULTS: ob-rust-0.3
: org-babel-rust-main-wrapper

*** Tests
    :PROPERTIES:
    :CUSTOM_ID: 0.3-tests
    :END:

S'exécute normalement, le fichier source généré a tout encapsulé dans une fonction =main=.
*résultat attendu* : Hello, world!
#+BEGIN_SRC rust :results verbatim
  println!("Hello, world!");
#+END_SRC

#+RESULTS:
: Hello, world!

S'exécute normalement, aucun traitement n'a été effectué sur le code source.
*résultat attendu* : Hello, world!
#+BEGIN_SRC rust :results verbatim
  fn main() {
      println!("Hello, world!");
  }
#+END_SRC

#+RESULTS:
: Hello, world!

Ajoute la directive =use= donnée en argument et exécute le code correctement.
*résultat attendu* : ["filename" (\, "1") (\, "2") (\, "bonjour")]
#+BEGIN_SRC rust :use std::env std::thread :cmdline 1 2 bonjour :results verbatim
  let args: Vec<String> = env::args().collect();
  println!("{:?}", args);
#+END_SRC

#+RESULTS:
: ["/tmp/babel-7991_kk/rust-src-79912h2" (\, "1") (\, "2") (\, "bonjour")]

Ajoute la directive =use= donnée en argument et exécute le code correctement.
*résultat attendu* : ["filename" (\, "1") (\, "2") (\, "bonjour")]
#+BEGIN_SRC rust :use std::thread :cmdline 1 2 bonjour :results verbatim
  use std::env;

  let args: Vec<String> = env::args().collect();
  println!("{:?}", args);
#+END_SRC

#+RESULTS:
: ["/tmp/babel-7991_kk/rust-src-7991QLf" (\, "1") (\, "2") (\, "bonjour")]

Ajoute la directive =use= donnée en argument et exécute le code correctement.
*résultat attendu* : ["filename" (\, "1") (\, "2") (\, "bonjour")]
#+BEGIN_SRC rust :use std::thread :cmdline 1 2 bonjour :results verbatim
  use std::env;

  fn main() {
      let args: Vec<String> = env::args().collect();
      println!("{:?}", args);
  }
#+END_SRC

#+RESULTS:
: ["/tmp/babel-7991_kk/rust-src-7991djN" (\, "1") (\, "2") (\, "bonjour")]

*** Tests
    :PROPERTIES:
    :CUSTOM_ID: 0.4-tests
    :END:

    A tester avec plusieurs types de variables :
    + entier
    + float
    + caractère
    + chaine

    #+BEGIN_SRC rust :results verbatim :var test=3
  println!("{:?}", test);
    #+END_SRC

    #+RESULTS:
    : 3

    #+BEGIN_SRC rust :results verbatim :var test=3.14
  println!("{:?}", test);
    #+END_SRC

    #+RESULTS:
    : 3.14

    #+BEGIN_SRC rust :results verbatim :var test='a'
  println!("{:?}", test);
    #+END_SRC

    #+RESULTS:
    : a

    #+BEGIN_SRC rust :results verbatim :var test="bonjour"
  println!("{:?}", test);
    #+END_SRC

    #+RESULTS:
    : bonjour

    #+BEGIN_SRC rust :results verbatim :var test_int=3 test_float=3.14 test_char='a' test_string="bonjour"
  fn main() {
      println!("{:?}", test_int);
      println!("{:?}", test_float);
      println!("{:?}", test_char);
      println!("{:?}", test_string);
  }
    #+END_SRC

    #+RESULTS:
    : 3
    : 3.14
    : 'a'
    : "bonjour"

    #+BEGIN_SRC rust :results verbatim :var mut_test=3
  test = 5;
  println!("{:?}", test);
    #+END_SRC

    #+RESULTS:
    : 5

    #+BEGIN_SRC rust :results verbatim :var prout:i32=4
  println!("{:?}", prout);
    #+END_SRC

    #+RESULTS:
    : 4

    #+BEGIN_SRC rust :results verbatim :var mut_prout:i64=4
  prout = 16;
  println!("{:?}", prout);
    #+END_SRC

    #+RESULTS:
    : 16

** 0.4.1

   Ajouter le support pour les booléens en rust.
   
   #+name: 0.4.1
   #+BEGIN_SRC elisp :tangle ob-rust.el
     (require 'ob)

     (defvar org-babel-tangle-lang-exts)
     (add-to-list 'org-babel-tangle-lang-exts '("rust" . "rs"))

     (defcustom org-babel-rust-command "rustc"
       "Name of the rust command."
       :group 'org-babel
       :type 'string)

     (defun org-babel-execute:rust (body params)
       (let* ((full-body (org-babel-expand-body:rust body params))
              (cmpflag (or (cdr (assq :cmpflag params)) ""))
              (cmdline (or (cdr (assq :cmdline params)) ""))
              (default-directory org-babel-temporary-directory)
              (src-file (org-babel-temp-file "rust-src-" ".rs"))
              (exe-file (org-babel-rust-exe-file src-file cmpflag))
              (results))
         (with-temp-file src-file
           (insert full-body)
           (when (require 'rust-mode nil t)
             (rust-format-buffer)))
         (org-babel-eval
          (format "%s %s %s" org-babel-rust-command cmpflag src-file) "")
         (setq results (org-babel-eval (format "%s %s" exe-file cmdline) ""))
         (org-babel-reassemble-table
          (org-babel-result-cond (cdr (assq :result-params params))
            (org-babel-read results)
            (let ((tmp-file (org-babel-temp-file "rs-")))
              (with-temp-file tmp-file (insert results))
              (org-babel-import-elisp-from-file tmp-file)))
          (org-babel-pick-name
           (cdr (assq :colname-names params)) (cdr (assq :colnames params)))
          (org-babel-pick-name
           (cdr (assq :rowname-names params)) (cdr (assq :rownames params))))))

       ;;; Helper functions.

     (defun org-babel-rust-exe-file (src-file cmpflag)
       "Compute the executable name according to the parameters given
        to the command line. It assumes that the source file has been
        created at (org-babel-temporary-directory). For spaces to be
        correctly recognized they need to be escaped."
       (if (string= cmpflag "")
           (file-name-sans-extension src-file)
         (let* ((flag-list (split-string cmpflag " "))
                (out-file (nth 1 (member "-o" flag-list)))
                (out-dir (nth 1 (member "--out-dir" flag-list))))
           (cond
            (out-file
             (if (string-match-p "^/" out-file) ;naive absolute file path detection
                 (expand-file-name out-file "/")
               (expand-file-name out-file org-babel-temporary-directory)))
            (out-dir
             (expand-file-name (file-name-base src-file) (file-name-as-directory out-dir)))
            (t
             (file-name-sans-extension src-file))))))

     (defun org-babel-rust-ensure-main-wrap (body vars)
       "Wrap BODY in a \"main\" function call if none exist. Inserts
       the variables right after the main declaration, regardless of
       the \"main\" existence."
       (let ((rust-main-regexp "^[ \t]*fn[ \t\n\r]*main[ \t]*()[ \t\n]*{[ \t]*")
             (rust-main-wrapper "fn main() {\n\t%s\n\t%s\n}")
             (pos nil))
         (if (string-match rust-main-regexp body)
             (progn
               (setq pos (match-end 0))
               (concat
                (substring body 0 pos)
                "\n"
                (mapconcat 'org-babel-rust-var-to-rust vars "\n")
                (substring body pos nil)))
           (format
            rust-main-wrapper
            (mapconcat 'org-babel-rust-var-to-rust vars "\n")
            body))))

     (defun org-babel-expand-body:rust (body params)
       "Expand a block of rust code with org-babel according to its
       header arguments."
       (let* ((main-p (not (string= (cdr (assq :main params)) "no")))
              (uses (org-babel-read (cdr (assq :use params)) nil))
              (vars (org-babel--get-vars params)))
         (when (stringp uses)
           (setq uses (split-string uses)))
         (mapconcat
          'identity
          (list
           ;; uses
           (mapconcat
            (lambda (use) (format "use %s;" use))
            uses
            "\n")
           ;; main vith vars if present
           (org-babel-rust-ensure-main-wrap body vars))
          "\n\t")))

     (defun org-babel-rust-val-to-rust-type (val)
       "Infers the correct rust data type from the value of the given
       argument."
       (cond
        ((symbolp val)
         (cond
          ((= (length (symbol-name val)) 1) 'char)
          ((or (string= val "true") (string= val "false")) 'bool)
          (t '&str)))
        ((stringp val)
         (cond
          ((or (string= val "true") (string= val "false")) 'bool)
          (t '&str)))
        ((integerp val)
         'isize)
        ((floatp val)
         'f64)
        (t
         nil)))

     (defun org-babel-rust-var-to-rust (var-pairs)
       "Formats a given variable name, variable value pair according
     to its type in correct rust.

     The variable name follows the following rules :

     - if the name starts with \"mut_\", the variable will be declared
     as mutable in rust code, and be referenced by its name minus the
     \"mut\",

     - if the name is followed by a \":\", the text preceding the
     \"=\" sign will be treated as its type. If no type is given one
     will be infered."
       (let* ((var (car var-pairs))
              (val (cdr var-pairs))
              (value-type (org-babel-rust-val-to-rust-type val))
              (var-s (symbol-name var))
              (var-regexp "\\(^mut_\\)?\\([[:alnum:]_]+\\)\\(: ?[[:alnum:]]+\\)?[ \t]*$")
              (mut
               (progn
                 (string-match var-regexp var-s)
                 (match-string 1 var-s)))
              (var-name
               (progn
                 (string-match var-regexp var-s)
                 (match-string 2 var-s)))
              (var-type
               (or
                (progn
                  (string-match var-regexp var-s)
                  (match-string 3 var-s))
                (format ":%s" (symbol-name (org-babel-rust-val-to-rust-type val)))))
              (pre (format "let %s"
                           (if (string-match "^mut_" var-s)
                               (concat "mut " (substring var-s (match-end 0) nil))
                             var)))
              (value (cond
                      ((string-match-p ": ?[iuf]" var-type) (format "%s" val))
                      ((string-match-p ": ?bool" var-type) (format "%s" val))
                      ((string-match-p ": ?char" var-type) (format "'%s'" val))
                      (t (format "\"%s\"" val)))))
         (setq mut (when mut "mut "))
         (concat "let " mut var-name var-type " = " value ";")))

     (provide 'ob-rust)
   #+END_SRC

   #+RESULTS: 0.4.1
   : ob-rust

   
   #+BEGIN_SRC rust :results verbatim :var test='true
  if test {
    println!("42");
  }
   #+END_SRC

   #+RESULTS:
   : 42
   
#+BEGIN_SRC rust :results verbatim :var test="false"
  if !test {
    println!("42");
  }
   #+END_SRC

   #+RESULTS:
   : 42

